In [1]:
import pandas as pd
import os
import numpy as np

In [4]:
path = os.getcwd()

In [5]:
path

'C:\\Users\\UditKhandelwal\\Desktop\\upGrad'

In [8]:
path = os.getcwd() + "\pokemon.csv"
df=pd.read_csv(path)
df.head()

,id,Index,Name,Form,Type1,Type2,HP,Attack,Defense,SpAtk,SpDef,Speed
0,1,1,Bulbasaur,Bulbasaur,Grass,Poison,45,49,49,65,65,45
1,2,2,Ivysaur,Ivysaur,Grass,Poison,60,62,63,80,80,60
2,3,3,Venusaur,Venusaur,Grass,Poison,80,82,83,100,100,80
3,4,4,Charmander,Charmander,Fire,NaN,39,52,43,60,50,65
4,5,5,Charmeleon,Charmeleon,Fire,NaN,58,64,58,80,65,80

In [31]:
df1=df[['Name','HP','Attack']]

In [32]:
df1[["HP","Attack"]].sum()

HP        74314
Attack    84458
dtype: int64

In [33]:
df1["HP"].count()

1061

In [34]:
df2=df[['Name','HP','Attack']].head()

In [35]:
df2.count()

Name      5
HP        5
Attack    5
dtype: int64

In [37]:

#FEBRURARY 29

In [47]:
ud=pd.DataFrame(np.random.randn(5,3), index=[1,3,5,6,7], columns=['a','b','c'])

In [40]:
ud

          a         b         c
1  0.890093 -0.270827  0.319458
3 -1.570869  0.461157 -1.144846
5  0.716308  2.264787 -0.142882
6  0.923739  0.441880  0.210073
7 -0.441893  0.419010 -0.033690

In [48]:
ud=ud.reindex(index=[1,2,3,4,5,6,7])
ud

          a         b         c
1 -0.394970 -0.011397 -0.058554
2       NaN       NaN       NaN
3  1.086097  0.490387 -1.158393
4       NaN       NaN       NaN
5 -0.496592  0.289898 -0.065004
6  0.784671 -1.357308 -0.777679
7 -1.172734  0.196121 -0.688232

In [49]:
ud.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 1 to 7
Data columns (total 3 columns):
a    5 non-null float64
b    5 non-null float64
c    5 non-null float64
dtypes: float64(3)
memory usage: 224.0 bytes

In [50]:
ud.describe()

              a         b         c
count  5.000000  5.000000  5.000000
mean  -0.038705 -0.078460 -0.549572
std    0.944158  0.737330  0.479016
min   -1.172734 -1.357308 -1.158393
25%   -0.496592 -0.011397 -0.777679
50%   -0.394970  0.196121 -0.688232
75%    0.784671  0.289898 -0.065004
max    1.086097  0.490387 -0.058554

In [51]:
ud.isnull()

       a      b      c
1  False  False  False
2   True   True   True
3  False  False  False
4   True   True   True
5  False  False  False
6  False  False  False
7  False  False  False

In [54]:
ud.isnull().sum()

a    2
b    2
c    2
dtype: int64

In [55]:
#ud[not ud.isnull()]

In [56]:
ud.median()

a   -0.394970
b    0.196121
c   -0.688232
dtype: float64

In [57]:
ud.fillna(0)

          a         b         c
1 -0.394970 -0.011397 -0.058554
2  0.000000  0.000000  0.000000
3  1.086097  0.490387 -1.158393
4  0.000000  0.000000  0.000000
5 -0.496592  0.289898 -0.065004
6  0.784671 -1.357308 -0.777679
7 -1.172734  0.196121 -0.688232

In [62]:
ud=ud.replace(0, np.nan)
ud

          a         b         c
1 -0.394970 -0.011397 -0.058554
2       NaN       NaN       NaN
3  1.086097  0.490387 -1.158393
4       NaN       NaN       NaN
5 -0.496592  0.289898 -0.065004
6  0.784671 -1.357308 -0.777679
7 -1.172734  0.196121 -0.688232

In [63]:
ud.fillna(ud.median())

          a         b         c
1 -0.394970 -0.011397 -0.058554
2 -0.394970  0.196121 -0.688232
3  1.086097  0.490387 -1.158393
4 -0.394970  0.196121 -0.688232
5 -0.496592  0.289898 -0.065004
6  0.784671 -1.357308 -0.777679
7 -1.172734  0.196121 -0.688232